#### ConfigurationReloadInfo Members

---

|  |
| --- |
| ConfigurationReloadInfo Class   Constructors   Methods   Properties   See Also |

The  ConfigurationReloadInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ConfigurationReloadInfo | Constructor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ConfigurationReloadInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetConnectivityValidation | Returns information about the post-reload connectivity validation. |
| Public method | GetCustomDataChangedElements | Gets a list of ElementIds of fabrication parts that had custom data updated during the reload. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetOutOfDatePartStatus | Access reload information for out of date part. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Disconnects | The number of disconnections caused by the reload. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OutOfDatePartCount | The number of fabrication part instances that had newer versions and were out of date. |
| Public property | ProfileNotAvailable | The current profile is not available in the disk configuration. |

# See Also

ConfigurationReloadInfo Class

Autodesk.Revit.DB Namespace